# NameNum

## Description
Function NameNum returns the number of different object names in the active VectorWorks document.

```pascal
FUNCTION NameNum : LONGINT;
```

```python
def vs.NameNum():
    return LONGINT
```

## Version
Availability: from All Versions

## Category
* Object Names